# ==========================================
# ML COPY
# Configurações do Sistema
# ==========================================

APP_NAME = "ML COPY"
APP_VERSION = "0.1.0"

# =====================================================
# JANELA
# =====================================================

WINDOW_WIDTH = 1300
WINDOW_HEIGHT = 800

# =====================================================
# BANCO
# =====================================================

DATABASE_FILE = "data/mlcopy.db"

# =====================================================
# APARÊNCIA
# =====================================================

THEME = "blue"
APPEARANCE = "light"

# =====================================================
# MERCADO LIVRE
# =====================================================

ML_SITE = "MLB"

CLIENT_ID = "2269355868254047"
CLIENT_SECRET = "yjyEzTZ2HG0HTcM0VIjZOVJXIdGP1PTX"

REDIRECT_URI = "https://ml-copy.onrender.com/callback"
# =====================================================
# CÓPIA
# =====================================================

DEFAULT_PRICE_INCREMENT = 0.00

MAX_ADVERTISEMENTS_PER_COPY = 100

ONLY_ACTIVE_ADS = True

INDEPENDENT_STOCK = True

USE_SKU = False

# =====================================================
# LOGS
# =====================================================

LOG_LEVEL = "INFO"